src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

src/Catalogs/СК_Ячейки/СК_Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_Ячейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/СК_МобСклад/Forms/ИнформацияПоЯчейке/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШК.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШК.ОбновитьТекстРедактирования();
	Элементы.ШК.Видимость = Ложь;
	Элементы.ШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШК = "";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШК;
КонецПроцедуры

&НаСервере
Процедура ШКИзменениеТекстаРедактированияНаСервере(ШК)
	Ячейка = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК));
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
|ИЗ
|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
|ГДЕ
|	СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка";
		Запрос.УстановитьПараметр("Ячейка",Ячейка.Ссылка);
		РезЯч = Запрос.Выполнить().Выгрузить();
		Инф = "";
		Если РезЯч.Количество()>=1 Тогда 
			Инф = Инф + "Остатки по ячейке:"+ Символы.ПС;
			Для Каждого стр из РезЯч  Цикл
				Инф = Инф + Строка(стр.Номенклатура)+" -  "+Строка(стр.ВналичииОстаток)+" "+стр.Номенклатура.ЕдиницаИзмерения+ Символы.ПС;
	
			КонецЦикла;
			
		
		
		ЭтаФорма.Элементы.Информация.Заголовок = Инф;
		ЭтаФорма.Элементы.Ошибка.Заголовок = "";
	Иначе   
		ЭтаФорма.Элементы.Информация.Заголовок = "";
		ЭтаФорма.Элементы.Ошибка.Заголовок = "Ячейка пустая";
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры
